/*
A. Κατασκευάστε την κλάση task (εργασία) με ιδιωτικά πεδία from (χρονική στιγμή έναρξης),
to (χρονική στιγμή λήξης) και description (περιγραφή). Η χρονική στιγμή έναρξης και η
χρονική στιγμή λήξης να είναι ακέραιες μη αρνητικές τιμές.
B. Δημιουργήστε έναν κατασκευαστή έτσι ώστε να ορίζονται και τα 3 πεδία μέσω
παραμέτρων.
Γ. Δημιουργήστε getters και setters μόνο για το πεδίο description.
Δ. Δημιουργήστε μια συνάρτηση με όνομα has_conflict (είναι σε σύγκρουση) που να δέχεται
ως όρισμα ένα αντικείμενο task και να ελέγχει επιστρέφοντας true ή false το εάν τα δύο
tasks επικαλύπτονται χρονικά.
Ε. Υπερφορτώστε τον τελεστή << έτσι ώστε να εμφανίζει τα στοιχεία ενός task.
ΣΤ. Στη main δημιουργήστε έναν πίνακα με 4 αντικείμενα task και εμφανίστε με τη χρήση
του τελεστή << ποια από αυτά δεν βρίσκονται σε σύγκρουση με κανένα άλλο task.
*/
